In [2]:
import sqlite3

In [5]:
db =sqlite3.connect('IMDB.sqlie')
# if file not there then it create new but not give error
db

In [18]:
db =sqlite3.connect('school.sqlie')
db

In [19]:
cur = db.cursor()

In [21]:
sql_query = 'create table student (roll no int primary key, name text, age int)'
cur.execute(sql_query)

OperationalError: table student already exists

In [22]:
cur.execute('insert into student values (101,"aman", 20)')

In [23]:
# if you now try to see the change inm the db then you not get any chang e
# for that you have to tell that hey do change in the db 
# for that an command is used
db.commit()

In [27]:
cur.execute('insert into student values (102,"ravi", 30)')
db.commit()

IntegrityError: UNIQUE constraint failed: student.roll

In [32]:
a= cur.execute('select * from student')
print(a)

<sqlite3.Cursor object at 0x00000170C7C6A9C0>

In [33]:
cur.execute('drop table student')

In [35]:
db.commit()

In [36]:
cur.execute('insert into student values (102,"ravi", 30)')
db.commit()

OperationalError: no such table: student

In [37]:
# after proferming the query good to close the db by use
db.close()

# l2

In [49]:
import sqlite3
db =sqlite3.connect('school2.sqlie')
cur = db.cursor()
db

In [52]:
sql_query = 'create table student (roll no int primary key, name text, age int)'
cur.execute(sql_query)

In [53]:
cur.execute('insert into student values (102,"ravi", 30)')
db.commit()

In [56]:
# inserting 
roll = 104
name = "nikhil"
age = 34
cur.execute('insert into student values (?,?,?)', (roll, name, age))
#after ??? value will provide in tuple
db.commit()

IntegrityError: UNIQUE constraint failed: student.roll

In [55]:
# inserting many
val = [(105, "nidhii", 20), (106, "manihsa", 34)]
cur.executemany('insert into student values (?,?,?)',val)

In [57]:
db.commit()

In [58]:
# upadte

In [64]:
cur.execute('update student set age = 12')
db.commit()

In [65]:
new_age = 50
cur.execute('update student set age = ?', new_age)
db.commit()

ProgrammingError: parameters are of unsupported type

In [66]:
#above give error beacuse we have to give value in gorm of tuple

In [69]:
new_age = 50
cur.execute('update student set age = ?', (new_age))
db.commit()

ProgrammingError: parameters are of unsupported type

In [71]:
# stil error becuse for make it tuple we have to add , 
new_age = 50
cur.execute('update student set age = ?', (new_age,))
db.commit()

# Question

In [88]:
db =sqlite3.connect('questin.sqlie')
cur = db.cursor()
cur.execute('create table Employees (employee_id int primary key, name text, age int, department text,salary int )')
db.commit()
db

## Open and read data file as specified in the question
## Print the required output in given format
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]

name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']

age=[25,27,25,24,30,26,23,26,25,26,29,24]

department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']

salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]

In [89]:
employee_id=(101,102,103,104,105,106,107,108,109,110,111,112)
name=('Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya')
age=(25,27,25,24,30,26,23,26,25,26,29,24)
department=('Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing')
salary=(50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000)

In [92]:
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]

In [102]:
lst =[]
for i in range(len(name)):
    temp=[employee_id[i], name[i],age[i], department[i], salary[i]]
    lst.append(tuple(temp))

In [108]:
for i in lst:
    print(i)

(101, 'Aadarsh', 25, 'Marketing', 50000)
(102, 'Aarti', 27, 'Operations', 60000)
(103, 'Siddharth', 25, 'Finance', 85000)
(104, 'Aman', 24, 'Human Resource', 75000)
(105, 'Amit', 30, 'Marketing', 50000)
(106, 'Shivansh', 26, 'IT', 90000)
(107, 'Vaibhav', 23, 'Finance', 85000)
(108, 'Himanshu', 26, 'IT', 90000)
(109, 'Raman', 25, 'Operations', 60000)
(110, 'Kunal', 26, 'Marketing', 50000)
(111, 'Adhira', 29, 'Human Resource', 75000)
(112, 'Tanya', 24, 'Marketing', 50000)

In [90]:
val=[employee_id,name,age,department,salary]

In [109]:
cur.executemany('insert into Employees values (?,?,?,?,?)', lst)

In [110]:
db.commit()

In [111]:
cur.execute('select * from Employees')

In [112]:
for i in cur:
    print(i)

(101, 'Aadarsh', 25, 'Marketing', 50000)
(102, 'Aarti', 27, 'Operations', 60000)
(103, 'Siddharth', 25, 'Finance', 85000)
(104, 'Aman', 24, 'Human Resource', 75000)
(105, 'Amit', 30, 'Marketing', 50000)
(106, 'Shivansh', 26, 'IT', 90000)
(107, 'Vaibhav', 23, 'Finance', 85000)
(108, 'Himanshu', 26, 'IT', 90000)
(109, 'Raman', 25, 'Operations', 60000)
(110, 'Kunal', 26, 'Marketing', 50000)
(111, 'Adhira', 29, 'Human Resource', 75000)
(112, 'Tanya', 24, 'Marketing', 50000)

In [115]:
# other way
# fetchone, fetchmany, fetchall
cur.execute('select * from Employees')
cur.fetchone()

(102, 'Aarti', 27, 'Operations', 60000)

In [116]:
cur.fetchone()

(103, 'Siddharth', 25, 'Finance', 85000)

In [122]:
cur.execute('select * from Employees')
# now curr store the result of select * form Emplolyees
cur.fetchmany(2)

[(101, 'Aadarsh', 25, 'Marketing', 50000),
 (102, 'Aarti', 27, 'Operations', 60000)]

In [124]:
cur.execute('select * from Employees')
cur.fetchall()

[(101, 'Aadarsh', 25, 'Marketing', 50000),
 (102, 'Aarti', 27, 'Operations', 60000),
 (103, 'Siddharth', 25, 'Finance', 85000),
 (104, 'Aman', 24, 'Human Resource', 75000),
 (105, 'Amit', 30, 'Marketing', 50000),
 (106, 'Shivansh', 26, 'IT', 90000),
 (107, 'Vaibhav', 23, 'Finance', 85000),
 (108, 'Himanshu', 26, 'IT', 90000),
 (109, 'Raman', 25, 'Operations', 60000),
 (110, 'Kunal', 26, 'Marketing', 50000),
 (111, 'Adhira', 29, 'Human Resource', 75000),
 (112, 'Tanya', 24, 'Marketing', 50000)]

In [146]:
cur.execute('select employee_id from Employees where Department = "Finance"')
for i in cur:
    print(*i)

103
107

In [138]:
sql_query = """SELECT name FROM sqlite_master WHERE type='table';"""
cur.execute(sql_query)
print(cur.fetchall)

<built-in method fetchall of sqlite3.Cursor object at 0x00000170C7EAA6C0>